## Combine data from CAO files

Other notebooks in this repo have imported the data from the CAO website and saved to csv files.

This notebook will use the csv files, tidy up the data and combine into a new dataframe.

***

In [1]:
#will be using pandas to read in the csv files and tidy up the data for a new combined dataframe
import pandas as pd

<br>  

**Bring in 2019 points**

In [2]:
#read in the 2019 csv file to a dataframe
df2019 = pd.read_csv("../data/cao-2019.csv")

In [3]:
#Have a look at the top of the dataframe
df2019.head()

,Unnamed: 0,0,1,2,3
0,0,Course Code,INSTITUTION and COURSE,EOS,Mid
1,1,AL801,Software Design with Virtual Reality and Gaming,304,328
2,2,AL802,Software Design with Cloud Computing,301,306
3,3,AL803,Software Design with Mobile Apps and Connected...,309,337
4,4,AL805,Network Management and Cloud Infrastructure,329,442

In [4]:
#need to use row 0 as the header
df2019.columns = df2019.iloc[0]

In [5]:
#redo the dataframe without row 0 now that we have the columns
df2019 = df2019[1:]

In [6]:
#have a look
df2019.head()

0  0 Course Code                             INSTITUTION and COURSE  EOS  Mid
1  1       AL801    Software Design with Virtual Reality and Gaming  304  328
2  2       AL802               Software Design with Cloud Computing  301  306
3  3       AL803  Software Design with Mobile Apps and Connected...  309  337
4  4       AL805        Network Management and Cloud Infrastructure  329  442
5  5       AL810                                 Quantity Surveying  307  349

In [7]:
#look again
df2019.head()

0  0 Course Code                             INSTITUTION and COURSE  EOS  Mid
1  1       AL801    Software Design with Virtual Reality and Gaming  304  328
2  2       AL802               Software Design with Cloud Computing  301  306
3  3       AL803  Software Design with Mobile Apps and Connected...  309  337
4  4       AL805        Network Management and Cloud Infrastructure  329  442
5  5       AL810                                 Quantity Surveying  307  349

In [8]:
#count the number of courses
df2019.count()

0
0                         930
Course Code               930
INSTITUTION and COURSE    930
EOS                       926
Mid                       915
dtype: int64

In [9]:
#renaming columns for consistency with other years
df2019.columns=['Not Needed','Code','Course','Round1','Round2']

***

<br>  

**Bring in 2020 points**

In [10]:
#read in the 2020 csv file to a dataframe
df2020 = pd.read_csv("../data/cao-2020.csv")

In [11]:
#Have a look at the top of the dataframe
df2020.head()

,Unnamed: 0,COURSE TITLE,COURSE CODE2,R1 POINTS,R2 POINTS,LEVEL
0,0,International Business,AC120,209,NaN,8
1,1,Liberal Arts,AC137,252,NaN,8
2,2,"First Year Art & Design (Common Entry,portfolio)",AD101,#+matric,NaN,8
3,3,Graphic Design and Moving Image Design (portfo...,AD102,#+matric,NaN,8
4,4,Textile & Surface Design and Jewellery & Objec...,AD103,#+matric,NaN,8

In [12]:
#renaming columns for consistency with other years
df2020.columns=['Not needed','Course','Code','Round1','Round2','Level']

In [13]:
#filter on level 8 courses and remove
df2020 = df2020.loc[df2020['Level']==8]

In [14]:
#determine number of rows
df2020.count()

Not needed    1027
Course        1027
Code          1027
Round1        1008
Round2         212
Level         1027
dtype: int64

In [15]:
#look again
df2020.head()

,Not needed,Course,Code,Round1,Round2,Level
0,0,International Business,AC120,209,NaN,8
1,1,Liberal Arts,AC137,252,NaN,8
2,2,"First Year Art & Design (Common Entry,portfolio)",AD101,#+matric,NaN,8
3,3,Graphic Design and Moving Image Design (portfo...,AD102,#+matric,NaN,8
4,4,Textile & Surface Design and Jewellery & Objec...,AD103,#+matric,NaN,8

***

<br>  

**Bring in 2021 points**

In [16]:
#read in the 2021 csv file to a dataframe
df2021 = pd.read_csv("../data/cao-2021.csv")

In [17]:
#Have a look at the top of the dataframe
df2021.head()

  Course                                               Desc Round1 Round2
0  AL801  Software Design for Virtual Reality and Gaming...    300
1  AL802  Software Design in Artificial Intelligence for...    313
2  AL803  Software Design for Mobile Apps and Connected ...    350
3  AL805  Computer Engineering for Network Infrastructur...    321
4  AL810  Quantity Surveying                            ...    328

In [18]:
#renaming columns for consistency with other years
df2021.columns=['Code','Course','Round1','Round2']

In [19]:
df2021.head()

    Code                                             Course Round1 Round2
0  AL801  Software Design for Virtual Reality and Gaming...    300
1  AL802  Software Design in Artificial Intelligence for...    313
2  AL803  Software Design for Mobile Apps and Connected ...    350
3  AL805  Computer Engineering for Network Infrastructur...    321
4  AL810  Quantity Surveying                            ...    328

In [20]:
df2021.count()

Code      949
Course    949
Round1    920
Round2    859
dtype: int64

***

In [21]:
#
df2019.loc[:,['Code','Course']]

      Code                                             Course
1    AL801    Software Design with Virtual Reality and Gaming
2    AL802               Software Design with Cloud Computing
3    AL803  Software Design with Mobile Apps and Connected...
4    AL805        Network Management and Cloud Infrastructure
5    AL810                                 Quantity Surveying
..     ...                                                ...
926  WD200                                     Arts (options)
927  WD210                       Software Systems Development
928  WD211                                 Creative Computing
929  WD212                    Recreation and Sport Management
930  WD230           Mechanical and Manufacturing Engineering

[930 rows x 2 columns]

In [22]:
#stack all the years into a new frame using only the code and the course
dfAllYears = pd.concat([df2019.loc[:,['Code','Course']],df2020.loc[:,['Code','Course']],df2021.loc[:,['Code','Course']]],ignore_index=True)

In [23]:
#This should equal the sum of the 3 dfs 
print((930 + 1027 + 949 ))
dfAllYears.count()

2906

Code      2906
Course    2906
dtype: int64

In [24]:
#have a look at the new datafram
dfAllYears.head()

    Code                                             Course
0  AL801    Software Design with Virtual Reality and Gaming
1  AL802               Software Design with Cloud Computing
2  AL803  Software Design with Mobile Apps and Connected...
3  AL805        Network Management and Cloud Infrastructure
4  AL810                                 Quantity Surveying

In [25]:
#sort the data fram by code to visualize duplicates
dfAllYears.sort_values(by=['Code'])

       Code                                             Course
168   AC120                             International Business
2132  AC120  International Business                        ...
930   AC120                             International Business
2133  AC137  Liberal Arts                                  ...
169   AC137                                       Liberal Arts
...     ...                                                ...
929   WD230           Mechanical and Manufacturing Engineering
1956  WD230           Mechanical and Manufacturing Engineering
2903  WD230  Mechanical and Manufacturing Engineering      ...
2904  WD231  Early Childhood Care and Education            ...
2905  WD232  Business Information Systems                  ...

[2906 rows x 2 columns]

In [26]:
#need to tidy up above as courses slightly out - one year has ... at end

In [27]:
#have a look for duplicates
dfAllYears.duplicated(subset=['Code'])

0       False
1       False
2       False
3       False
4       False
        ...
2901     True
2902     True
2903     True
2904    False
2905    False
Length: 2906, dtype: bool

In [28]:
#false is 0 and true is 1 therefore can sum the trues
dfAllYears.duplicated(subset=['Code']).sum()

1692

In [29]:
#drop the duplicates
dfAllYears.drop_duplicates(subset=['Code'],ignore_index=True,inplace=True)

In [30]:
dfAllYears.head()

    Code                                             Course
0  AL801    Software Design with Virtual Reality and Gaming
1  AL802               Software Design with Cloud Computing
2  AL803  Software Design with Mobile Apps and Connected...
3  AL805        Network Management and Cloud Infrastructure
4  AL810                                 Quantity Surveying

In [31]:
dfAllYears.count()

Code      1214
Course    1214
dtype: int64

In [32]:
dfAllYears

       Code                                             Course
0     AL801    Software Design with Virtual Reality and Gaming
1     AL802               Software Design with Cloud Computing
2     AL803  Software Design with Mobile Apps and Connected...
3     AL805        Network Management and Cloud Infrastructure
4     AL810                                 Quantity Surveying
...     ...                                                ...
1209  SG349  Electronics and Self Driving Technologies     ...
1210  SG350  Robotics and Automation                       ...
1211  TL874  Inclusive Sport and Physical Activity         ...
1212  WD231  Early Childhood Care and Education            ...
1213  WD232  Business Information Systems                  ...

[1214 rows x 2 columns]

***  
## to do
join points data from other years to his dataframe
***